app/controllers/tareas_controller.rb

  def create
    @tarea = Tarea.new(tarea_params)
    respond_to do |format|
      if @tarea.save
---
INSERT INTO `tareas` (`created_at`, `nombre`, `updated_at`) VALUES ('2014-09-07 15:30:53', 'mmm', '2014-09-07 15:30:53')

  def update
    @tarea = Tarea.find(params['id'])
    respond_to do |format|
      if @tarea.toggle!(:terminada);
---
UPDATE `tareas` SET `terminada` = 0, `updated_at` = '2014-09-07 15:30:42' WHERE `tareas`.`id` = 8

    def set_tarea
      @tarea = Tarea.find(params[:id])
---
SELECT  `tareas`.* FROM `tareas`  WHERE `tareas`.`id` = 8 LIMIT 1